# IsAssociatedWithBuildingPad Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TopographySurface..::..IsAssociatedWithBuildingPad Property
TopographySurface Class See Also
---
Identifies if this element represents a topography surface associated with a building pad.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool IsAssociatedWithBuildingPad { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsAssociatedWithBuildingPad As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsAssociatedWithBuildingPad {
	bool get ();
}
```

# See Also
TopographySurface Class
Autodesk.Revit.DB.Architecture Namespace